#+TITLE:     #ifdef in elisp
#+AUTHOR:    George M. Jones
#+EMAIL:     gmj@cert.org
#+DATE:      2013-05-15 Wed
#+TEXT:	     This file defines elisp functions that perform the equivalent of cpp(1)s #ifdef

* ifdef keybindings and setup
  #+BEGIN_SRC elisp :exports code
  (global-set-key (kbd "C-x # i") 'ifdef-ifdef)
  (global-set-key (kbd "C-x # d") 'ifdef-define)
  (global-set-key (kbd "C-x # b") 'ifdef-buffer)

  ; define global config things for ifdef.
  ; I'm pretty sure global setq is not the right way...

  ; set one of these
  (setq ifdef-delete-chunks t) ;  delete non-matching chunks
  (setq ifdef-comment-chunks nil) ;  delete non-matching chunks
  (setq comment-start "#")

  (defun my-text-mode-hook ()
    (setq comment-start "#")
    ; (message "my-text-mode-hook ran.")
    )

  (add-hook 'text-mode-hook 'my-text-mode-hook)
  #+END_SRC

  #+RESULTS:
  | my-text-mode-hook | text-mode-hook-identify |

